Revit 2024 API
MEPNetworkIterator Class
 An iterator to traverse the MEP analytical network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class MEPNetworkIterator : IDisposable
Visual Basic
Public Class MEPNetworkIterator _
	Implements IDisposable
Visual C++
public ref class MEPNetworkIterator : IDisposable
Remarks
 The iterator will visit the entire MEP analytical network in the depth-first order. For evert next step, one analytical node and one analytical segment are typically visited. Sometimes an extra node is provided if the iteration reaches the end on one side and restarts at the previous intersect node. Also note that the start step may not contain any segment.
Examples
CopyC#
// Create a new MEPNetworkIterator to traverse a piping network in the depth-first order.
int segmentCount = 0;
MEPNetworkIterator netIter = new MEPNetworkIterator(doc, modelData, ConnectorDomainType.Piping);
for(netIter.Start(); !netIter.End(); netIter.Next())
{
   MEPAnalyticalSegment segment = netIter.GetAnalyticalSegment();
   if (segment != null)
      segmentCount++;
}
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPNetworkIterator
See Also
MEPNetworkIterator Members
Autodesk.Revit.DB.Analysis Namespace